# ----------------------------
# Разработчик: Andrey Sazhnev (dikey)
# Email: ausazhnev@gmail.com
# GitHub: https://github.com/ausazhnev
# Telegram: @ausazhnev
# Дата создания: 2025-05-03
# Дата последнего обновления:
# Описание: Мини-проект "шифр Цезаря v2" — На вход программе подаётся строка текста на английском языке,
#           в которой нужно зашифровать все слова. Каждое слово строки следует зашифровать с помощью
#           шифра Цезаря (циклического сдвига на длину этого слова). Строчные буквы при этом остаются
#           строчными, а прописные – прописными. Гарантируется, что между различными словами
#           присутствует один пробел.
# ----------------------------


def main() -> None:
    pass


if __name__ == "__main__":
    main()
