# ----------------------------
# Разработчик: Andrey Sazhnev (dikey)
# Email: ausazhnev@gmail.com
# GitHub: https://github.com/ausazhnev
# Telegram: @ausazhnev
# Дата создания: 2025-05-03
# Дата последнего обновления:
# Описание: Мини-проект "шифр Цезаря" — программа, способная шифровать и дешифровать текст в соответствии
#           с алгоритмом Цезаря.
#           Программа запрашивает у пользователя следующие данные:
#           - направление: шифрование или дешифрование;
#           - язык алфавита: русский или английский;
#           - шаг сдвига (со сдвигом вправо)..
# ----------------------------

def main() -> None:
    pass


if __name__ == "__main__":
    main()
